app/Controllers/Auth.php

SELECT *
FROM `login_user`
WHERE `nik` = '123'
---
    public function loginProcess()
    {
        $post = $this->request->getPost();
        $query = $this->db->table('login_user')->getWhere(['nik'=> $post['nik']]);