app/Controllers/MasterAtk.php

    public function index()
    {
        //query builder
        $db      = \Config\Database::connect();
        $builder = $db->table('master_atk');
        $query = $builder->get()->getResult();
---
SELECT *
FROM `master_atk`

    public function delete($id){
        $this->db->table('master_atk')->where(['id_barang_atk'=> $id])->delete();
---
DELETE FROM `master_atk`
WHERE `id_barang_atk` = 'galsdkjf'