app/Controllers/MasterAtk.php

DELETE FROM `master_atk`
WHERE `id` = '2'
---
    public function delete()
    {
        $id = $this->request->getPost('id');

        if (!$id) {
            return $this->response->setJSON([
                'status'  => 'error',
                'message' => 'ID tidak ditemukan'
            ]);
        }

        $builder = $this->db->table('master_atk');
        $deleted = $builder->delete(['id' => $id]);

UPDATE `master_atk` SET `kode_barang` = '40', `nama_barang` = 'BUKU TULIS', `harga` = '90', `satuan` = 'PACK', `tgl_tambah` = '2025-09-06'
WHERE `id` = '1'
SELECT *
FROM `master_atk`
WHERE `kode_barang` = '21'
---
    public function save()
    {
        $id = $this->request->getPost('id');

        $data = [
            'kode_barang' => $this->request->getPost('kode_barang'),
            'nama_barang' => $this->request->getPost('nama_barang'),
            'harga'       => $this->request->getPost('harga'),
            'satuan'      => $this->request->getPost('satuan'),
            'tgl_tambah'  => $this->request->getPost('tgl_tambah'),
        ];

        $builder = $this->db->table('master_atk');

        if ($id) {
            // Update
            $builder->where('id', $id)->update($data);
            return $this->response->setJSON([
                'status'  => 'success',
                'message' => 'Data berhasil diperbarui'
            ]);
        } else {
            // ✅ Cek duplikat kode_barang sebelum insert
            $cek = $builder->where('kode_barang', $data['kode_barang'])->get()->getRow();